In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

import seaborn as sns

## TB

In [42]:
lf = pd.read_csv( 'tb_tidy.csv' )

In [43]:
lf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11492 entries, 0 to 11491
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   country       11492 non-null  object
 1   year          11492 non-null  int64
 2   sex           11492 non-null  object
 3   total_number  11492 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 359.2+ KB

In [44]:
lf.head()

  country  year sex  total_number
0      AD  1989   f           0.0
1      AD  1989   m           0.0
2      AD  1990   f           0.0
3      AD  1990   m           0.0
4      AD  1991   f           0.0

In [45]:
lf.nunique()

country          212
year              29
sex                2
total_number    2415
dtype: int64

In [46]:
country_info = lf.groupby(['country']).size().reset_index(name='num_rows')
country_info.drop(columns=['num_rows'], inplace=True)
#this make a simpler table with just country

In [47]:
country_info

    country
0        AD
1        AE
2        AF
3        AG
4        AI
..      ...
207      YE
208      YU
209      ZA
210      ZM
211      ZW

[212 rows x 1 columns]

In [48]:
country_info['country_id'] = country_info.index + 1

In [49]:
country_info

    country  country_id
0        AD           1
1        AE           2
2        AF           3
3        AG           4
4        AI           5
..      ...         ...
207      YE         208
208      YU         209
209      ZA         210
210      ZM         211
211      ZW         212

[212 rows x 2 columns]

In [50]:
sex_info = lf.groupby(['sex']).size().reset_index(name='num_rows')
sex_info.drop(columns=['num_rows'], inplace=True)

In [51]:
sex_info

  sex
0   f
1   m

In [52]:
sex_info['sex_id'] = sex_info.index + 1

In [53]:
sex_info

  sex  sex_id
0   f       1
1   m       2

In [28]:
lf_copy = pd.merge( lf, country_info.loc[:, ['country_id', 'country']], on='country', how='left').\
merge(sex_info.loc[:, ['sex', 'sex_id']], on='sex', how='left')

In [55]:
lf_copy.drop(columns=['country', 'sex'], inplace=True)

In [57]:
lf_copy.head()

   year  total_number  country_id  sex_id
0  1989           0.0           1       1
1  1989           0.0           1       2
2  1990           0.0           1       1
3  1990           0.0           1       2
4  1991           0.0           1       1

In [58]:
tb_per_year = lf_copy.copy()

In [60]:
tb_per_year['id'] = tb_per_year.index + 1

In [61]:
tb_per_year.head()

   year  total_number  country_id  sex_id  id
0  1989           0.0           1       1   1
1  1989           0.0           1       2   2
2  1990           0.0           1       1   3
3  1990           0.0           1       2   4
4  1991           0.0           1       1   5

## Save the datasets

In [62]:
country_info.to_csv('country_info.csv', header=True, index=False)

In [63]:
sex_info.to_csv('sex.csv', header=True, index=False)

In [64]:
tb_per_year.to_csv('tb_per_year.csv', header=True, index=False)

## Stock Market

In [4]:
ls = pd.read_csv( '/Users/albertoguzman-alvarez/SQL/hw/hw3/stock_tidy.csv' )

In [6]:
ls.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   symbol    500 non-null    object
 1   date      500 non-null    object
 2   close     500 non-null    float64
 3   high      500 non-null    float64
 4   open      500 non-null    float64
 5   company   500 non-null    object
 6   sector    500 non-null    object
 7   exchange  500 non-null    object
 8   year      500 non-null    int64
 9   month     500 non-null    int64
 10  day       500 non-null    int64
 11  wday      500 non-null    int64
 12  quarter   500 non-null    int64
 13  o_c_diff  500 non-null    float64
dtypes: float64(4), int64(5), object(5)
memory usage: 54.8+ KB

In [7]:
ls.head()

,symbol,date,close,high,open,company,sector,exchange,year,month,day,wday,quarter,o_c_diff
0,AMZN,2020-09-01,3499.120117,3513.870117,3489.580078,Amazon.com Inc.,Consumer Discretionary,NASDAQ,2020,9,1,1,3,9.540039
1,AMZN,2020-09-02,3531.449951,3552.250000,3547.000000,Amazon.com Inc.,Consumer Discretionary,NASDAQ,2020,9,2,2,3,-15.550049
2,AMZN,2020-09-03,3368.000000,3488.409912,3485.000000,Amazon.com Inc.,Consumer Discretionary,NASDAQ,2020,9,3,3,3,-117.000000
3,AMZN,2020-09-04,3294.620117,3381.500000,3318.000000,Amazon.com Inc.,Consumer Discretionary,NASDAQ,2020,9,4,4,3,-23.379883
4,AMZN,2020-09-08,3149.840088,3250.850098,3144.000000,Amazon.com Inc.,Consumer Discretionary,NASDAQ,2020,9,8,1,3,5.840088

In [8]:
ls.nunique()

symbol        5
date        100
close       476
high        484
open        482
company       5
sector        3
exchange      2
year          2
month         5
day          31
wday          5
quarter       3
o_c_diff    455
dtype: int64

In [28]:
company_info = ls.groupby(['symbol','company','sector']).size().reset_index(name='num_rows')
company_info.drop(columns=['num_rows'], inplace=True)
#this make a simpler table with just country
company_info['company_id'] = company_info.index + 1

In [29]:
company_info

  symbol                      company                  sector  company_id
0   AMZN              Amazon.com Inc.  Consumer Discretionary           1
1    GME               GameStop Corp.  Consumer Discretionary           2
2     KO            Coca-Cola Company        Consumer Staples           3
3   TSLA                    Tesla Inc  Consumer Discretionary           4
4     VZ  Verizon Communications Inc.  Communication Services           5

In [25]:
ls.head()

,symbol,date,close,high,open,company,sector,exchange,year,month,day,wday,quarter,o_c_diff
0,AMZN,2020-09-01,3499.120117,3513.870117,3489.580078,Amazon.com Inc.,Consumer Discretionary,NASDAQ,2020,9,1,1,3,9.540039
1,AMZN,2020-09-02,3531.449951,3552.250000,3547.000000,Amazon.com Inc.,Consumer Discretionary,NASDAQ,2020,9,2,2,3,-15.550049
2,AMZN,2020-09-03,3368.000000,3488.409912,3485.000000,Amazon.com Inc.,Consumer Discretionary,NASDAQ,2020,9,3,3,3,-117.000000
3,AMZN,2020-09-04,3294.620117,3381.500000,3318.000000,Amazon.com Inc.,Consumer Discretionary,NASDAQ,2020,9,4,4,3,-23.379883
4,AMZN,2020-09-08,3149.840088,3250.850098,3144.000000,Amazon.com Inc.,Consumer Discretionary,NASDAQ,2020,9,8,1,3,5.840088

In [30]:
exchange_info = ls.groupby(['exchange']).size().reset_index(name='num_rows')
exchange_info.drop(columns=['num_rows'], inplace=True)
#this make a simpler table with just country
exchange_info['exchange_id'] = exchange_info.index + 1

In [31]:
exchange_info

  exchange  exchange_id
0   NASDAQ            1
1     NYSE            2

In [50]:
ls_copy = pd.merge( ls, company_info.loc[:, ['company_id', 'company']], on='company', how='left').\
merge(exchange_info.loc[:, ['exchange', 'exchange_id']], on='exchange', how='left')

In [51]:
ls_copy.head()

,symbol,date,close,high,open,company,sector,exchange,year,month,day,wday,quarter,o_c_diff,company_id,exchange_id
0,AMZN,2020-09-01,3499.120117,3513.870117,3489.580078,Amazon.com Inc.,Consumer Discretionary,NASDAQ,2020,9,1,1,3,9.540039,1,1
1,AMZN,2020-09-02,3531.449951,3552.250000,3547.000000,Amazon.com Inc.,Consumer Discretionary,NASDAQ,2020,9,2,2,3,-15.550049,1,1
2,AMZN,2020-09-03,3368.000000,3488.409912,3485.000000,Amazon.com Inc.,Consumer Discretionary,NASDAQ,2020,9,3,3,3,-117.000000,1,1
3,AMZN,2020-09-04,3294.620117,3381.500000,3318.000000,Amazon.com Inc.,Consumer Discretionary,NASDAQ,2020,9,4,4,3,-23.379883,1,1
4,AMZN,2020-09-08,3149.840088,3250.850098,3144.000000,Amazon.com Inc.,Consumer Discretionary,NASDAQ,2020,9,8,1,3,5.840088,1,1

In [52]:
ls_copy.drop(columns=['company', 'exchange','symbol','sector'], inplace=True)

In [53]:
stock_perday = ls_copy.copy()

In [54]:
stock_perday['id'] = stock_perday.index + 1

In [55]:
stock_perday.head()

,date,close,high,open,year,month,day,wday,quarter,o_c_diff,company_id,exchange_id,id
0,2020-09-01,3499.120117,3513.870117,3489.580078,2020,9,1,1,3,9.540039,1,1,1
1,2020-09-02,3531.449951,3552.250000,3547.000000,2020,9,2,2,3,-15.550049,1,1,2
2,2020-09-03,3368.000000,3488.409912,3485.000000,2020,9,3,3,3,-117.000000,1,1,3
3,2020-09-04,3294.620117,3381.500000,3318.000000,2020,9,4,4,3,-23.379883,1,1,4
4,2020-09-08,3149.840088,3250.850098,3144.000000,2020,9,8,1,3,5.840088,1,1,5

In [56]:
company_info.to_csv('company_info.csv', header=True, index=False)

In [57]:
exchange_info.to_csv('exchange_info.csv', header=True, index=False)

In [58]:
stock_perday.to_csv('stock_perday.csv', header=True, index=False)